//1
let n = prompt("Введіть натуральне число");
let f = 1;
if (n>1 || !n == 0 || !n == 1) {		
	for(let i = n; i>1; i--){
		f = f * i;						
	}	
}
else {
	alert("Потрібно ввести число, яке більше або = 0");
}
console.log(`факторіал числа ${n} становить ${f}`);

/*2 завдання. Створіть програму, що виводить на екран всі чотиризначні числа
послідовності 1000 1003 1006 1009 1012 1015.*/

for(let i = 1000;i<=9999; i+=3){	
	console.log(i);
}

/*3 завдання. Створіть програму, що виводить на екран перші 55 елементів
послідовності 1 3 5 7 9 11 13 15 17 ....*/

let counter = 0;
for(let j = 0; j>=0; j++){	
	if(j%2==1){
		counter++;
		console.log(`${counter})${j}`);
	}	
	if(counter==55) break;
}
/*4 завдання. Створіть програму, що виводить на екран всі невід&#39;ємні елементи
послідовності 90 85 80 75 70 65 60 ....*/

for(let k = 90; k<=90 && k>=0; k-=5){
	console.log(k);
}

/*5 завдання. Створіть програму, що виводить на екран перші 20 елементів
послідовності 2 4 8 16 32 64 128 ....*/
let p = 1;
let count =0;
for(let l =1; l<=20; l++){	
	count++;
	p +=p;
	console.log(`${count})${p}`);		
}

/*6 завдання. Виведіть на екран всі числа в послідовності 2a-1, де a1 = 2, які
менше 10000.*/	

let a = 2;
for(let i =0;  i<a; i++ ){	
	a=2*a-1;
	if(a>=10000) break;
	console.log(a);	
}

/*7 завдання. Виведіть на екран всі двозначні члени послідовності 2a+200, де
a1 = -166.*/

let a = -166;
if(a<100){
	for(let i=0; i>a; i++){
		a=2*a+200;
		if(a<=-100 || a>=-9 && a<=9) {continue}
			console.log(a);
	}
}


